output/dot/3.dot
digraph
{
   "01" [ label = "LEN 2 1" ];
   "02" [ label = "GETTABLE 2 1 2" ];
   "03" [ label = "NEWTABLE 3 0 0" ];
   "04" [ label = "EXTRAARG 0" ];
   "05" [ label = "GETTABUP 4 0 0" ];
   "06" [ label = "MOVE 5 0" ];
   "07" [ label = "CALL 4 2 5" ];
   "08" [ label = "TFORPREP 4 15" ];
   "09" [ label = "SELF 9 8 1" ];
   "10" [ label = "CALL 9 2 2" ];
   "11" [ label = "ADDI 9 9 -1" ];
   "12" [ label = "MMBINI 9 1 7 0" ];
   "13" [ label = "SELF 10 8 2" ];
   "14" [ label = "CALL 10 2 2" ];
   "15" [ label = "GETUPVAL 11 1" ];
   "16" [ label = "GETFIELD 12 2 3" ];
   "17" [ label = "MOVE 13 9" ];
   "18" [ label = "MOVE 14 10" ];
   "19" [ label = "CALL 11 4 2" ];
   "20" [ label = "GETUPVAL 12 2" ];
   "21" [ label = "MOVE 13 3" ];
   "22" [ label = "MOVE 14 11" ];
   "23" [ label = "CALL 12 3 1" ];
   "24" [ label = "TFORCALL 4 2" ];
   "25" [ label = "TFORLOOP 4 17" ];
   "26" [ label = "CLOSE 4" ];
   "27" [ label = "LEN 4 1" ];
   "28" [ label = "LTI 4 2 0" ];
   "29" [ label = "JMP 1" ];
   "30" [ label = "RETURN 3 2 0k" ];
   "31" [ label = "GETUPVAL 4 3" ];
   "32" [ label = "MOVE 5 1" ];
   "33" [ label = "LOADI 6 1" ];
   "34" [ label = "LEN 7 1" ];
   "35" [ label = "ADDI 7 7 -1" ];
   "36" [ label = "MMBINI 7 1 7 0" ];
   "37" [ label = "CALL 4 4 2" ];
   "38" [ label = "GETUPVAL 5 4" ];
   "39" [ label = "MOVE 6 3" ];
   "40" [ label = "MOVE 7 4" ];
   "41" [ label = "TAILCALL 5 3 0k" ];
   "42" [ label = "RETURN 5 0 0k" ];
   "43" [ label = "RETURN 5 1 0k" ];

   "01" -> "02" -> "03" -> "04" -> "05" -> "06" -> "07" ->
      "08" -> "24" -> "25" -> "09" -> "10" -> "11" -> "12" ->
      "13" -> "14" -> "15" -> "16" -> "17" -> "18" -> "19" ->
      "20" -> "21" -> "22" -> "23" -> "24";
   "11" -> "13";
   "25" -> "26" -> "27" -> "28" -> "29" -> "31" -> "32" ->
      "33" -> "34" -> "35" -> "36" -> "37" -> "38" -> "39" ->
      "40" -> "41";
   "35" -> "37";
   "28" -> "30";
}
