output/mmd/3.mmd
flowchart TD
  _01["LEN 2 1"]
  _02["GETTABLE 2 1 2"]
  _03["NEWTABLE 3 0 0"]
  _04["EXTRAARG 0"]
  _05["GETTABUP 4 0 0"]
  _06["MOVE 5 0"]
  _07["CALL 4 2 5"]
  _08["TFORPREP 4 15"]
  _09["SELF 9 8 1"]
  _10["CALL 9 2 2"]
  _11["ADDI 9 9 -1"]
  _12["MMBINI 9 1 7 0"]
  _13["SELF 10 8 2"]
  _14["CALL 10 2 2"]
  _15["GETUPVAL 11 1"]
  _16["GETFIELD 12 2 3"]
  _17["MOVE 13 9"]
  _18["MOVE 14 10"]
  _19["CALL 11 4 2"]
  _20["GETUPVAL 12 2"]
  _21["MOVE 13 3"]
  _22["MOVE 14 11"]
  _23["CALL 12 3 1"]
  _24["TFORCALL 4 2"]
  _25["TFORLOOP 4 17"]
  _26["CLOSE 4"]
  _27["LEN 4 1"]
  _28["LTI 4 2 0"]
  _29["JMP 1"]
  _30["RETURN 3 2 0k"]
  _31["GETUPVAL 4 3"]
  _32["MOVE 5 1"]
  _33["LOADI 6 1"]
  _34["LEN 7 1"]
  _35["ADDI 7 7 -1"]
  _36["MMBINI 7 1 7 0"]
  _37["CALL 4 4 2"]
  _38["GETUPVAL 5 4"]
  _39["MOVE 6 3"]
  _40["MOVE 7 4"]
  _41["TAILCALL 5 3 0k"]
  _42["RETURN 5 0 0k"]
  _43["RETURN 5 1 0k"]

  _01 --> _02 --> _03 --> _04 --> _05 --> _06 --> _07 --> _08
  _08 --> _24 --> _25 --> _09 --> _10 --> _11 --> _12 --> _13
  _13 --> _14 --> _15 --> _16 --> _17 --> _18 --> _19 --> _20
  _20 --> _21 --> _22 --> _23 --> _24
  _11 --> _13
  _25 --> _26 --> _27 --> _28 --> _29 --> _31 --> _32 --> _33
  _33 --> _34 --> _35 --> _36 --> _37 --> _38 --> _39 --> _40
  _40 --> _41
  _35 --> _37
  _28 --> _30
